# Amazonでの最親カテゴリとサイト内でのカテゴリのマッピングを行うための定数
AMAZON_ROOT_CATEGORY_MAP = {
  # デジタル・家電
  "637392"      => "ガジェット・家電", # PCソフト
  "2127209051"  => "ガジェット・家電", # パソコン・周辺機器
  "3210981"     => "ガジェット・家電", # 家電＆カメラ
  "2277724051"  => "ガジェット・家電", # 大型家電

  # 日用品・オフィス・ドラッグ
  "86731051"    => "日用品",       # 文房具・オフィス用品
  "160384011"   => "日用品",       # ドラッグストア
  "344845011"   => "日用品",       # ベビー用品・マタニティ
  "2127212051"  => "日用品",       # ペット用品

  # ビューティー
  "52374051"    => "ビューティー",       # ビューティー

  # 車・工具・産業
  "2017304051"  => "日用品",       # 車&バイク
  "2016929051"  => "日用品",       # DIY・工具・ガーデン
  "3445393051"  => "日用品",       # 産業・研究開発用品

  # 食品・飲料・お酒
  "57239051"    => "食料品",       # 食品・飲料・お酒

  # 衣類系
  "2229202051"  => "衣類・小物",         # ファッション
  "2230005051"  => "衣類・小物",         # 男性服・靴・ジュエリー
  "2230006051"  => "衣類・小物",         # 女性服・靴・ジュエリー
  "2230804051"  => "衣類・小物",         # ベビー服・靴・ジュエリー

  # ホーム＆キッチン
  "3828871"     => "ホーム＆キッチン", # ホーム＆キッチン

  # 趣味・遊び
  "637394"      => "趣味",         # TVゲーム
  "13299531"    => "趣味",         # おもちゃ
  "2277721051"  => "趣味",         # ホビー
  "2123629051"  => "趣味",         # 楽器
  "2381130051"  => "趣味",         # アプリ＆ゲーム
  "2128134051"  => "趣味",         # デジタルミュージック
  "465392"      => "趣味",         # 本
  "52033011"    => "趣味",         # 洋書
  "561956"      => "趣味",         # ミュージック
  "561958"      => "趣味",         # DVD
  "701040"      => "趣味",         # クラシック
  "14304371"    => "趣味",       # スポーツ&アウトドア

  # 特殊
  "2761990051"  => "その他",        # Amazonアウトレット
  "7471076051" => "その他",       # Audibleオーディオブック
  "2250738051" => "その他"       # Kindleストア
}.freeze
